# This line tells all casks to install to ~/Applications
cask_args appdir: "~/Applications"

# Taps
#tap "homebrew/bundle"
#tap "homebrew/cask-fonts"

# CLI tools
#brew "git" # use from xcode commandline tools
brew "sheldon" #shell plugin
brew "node" # Node.js for copilot cli and vscode extention dev
brew "telnet"
brew "graphviz"
brew "lsd"
brew "bat"
brew "tree"
brew "wget"
brew "fzf"
brew "zoxide"
brew "thefuck"
#brew "gcc"
brew "Gu1llaum-3/sshm/sshm"
brew "fastfetch"

# UI app
#cask "ghostty" # Terminal emulator

# Fonts
cask "font-symbols-only-nerd-font"
cask "visual-studio-code"

# Visual Studio Code extensions
#vscode "sapegin.theme-squirrelsonglight"
#vscode "sapegin.reveal-in-ghostty"
vscode "catppuccin.catppuccin-vsc"
vscode "oderwat.indent-rainbow"
vscode "alefragnani.project-manager"
vscode "mechatroner.rainbow-csv"
vscode "mk12.better-git-line-blame"
