# This line tells all casks to install to ~/Applications
cask_args appdir: "~/Applications"

# Taps
#tap "homebrew/bundle"
#tap "homebrew/cask-fonts"

# CLI tools
brew "git" # The Git
brew "starship" # Prompt manager
brew "node" # Fallback Node.js version
brew "telnet"
brew "graphviz"
brew "lsd"
brew "tree"
brew "wget"
#brew "gcc"

# UI app
cask "ghostty" # Terminal emulator

# Fonts
cask "font-symbols-only-nerd-font"
cask "visual-studio-code"

# Visual Studio Code extensions
#vscode "sapegin.theme-squirrelsonglight"
vscode "sapegin.reveal-in-ghostty"
vscode "catppuccin.catppuccin-vsc"
vscode "oderwat.indent-rainbow"
vscode "christian-kohler.path-intellisense"
vscode "alefragnani.project-manager"
vscode "mechatroner.rainbow-csv"

